# Building Panda Dataframe

In [2]:
import pandas as pd

In [3]:
data = {
    'Name':['Alice', 'Ram','Sita', 'David'],
    'Age': [25,56,52,41],
    'City': ['New York', 'KTM', 'Lalitpur', 'Boston']
}

df = pd.DataFrame(data)
print(df)
df

    Name  Age      City
0  Alice   25  New York
1    Ram   56       KTM
2   Sita   52  Lalitpur
3  David   41    Boston

    Name  Age      City
0  Alice   25  New York
1    Ram   56       KTM
2   Sita   52  Lalitpur
3  David   41    Boston

In [8]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes
None

In [9]:
print(df.describe())
df.describe()

             Age
count   4.000000
mean   43.500000
std    13.868429
min    25.000000
25%    37.000000
50%    46.500000
75%    53.000000
max    56.000000

             Age
count   4.000000
mean   43.500000
std    13.868429
min    25.000000
25%    37.000000
50%    46.500000
75%    53.000000
max    56.000000

In [10]:
data = {
    'Name':['Alice', 'Ram','Sita', 'David'],
    'Age': [25,56,52,41],
    'City': ['New York', 'KTM', 'Lalitpur', 'Boston']
}

In [11]:
df["Name"]

0    Alice
1      Ram
2     Sita
3    David
Name: Name, dtype: object

In [22]:
df["Age"]

0    25
1    56
2    52
3    41
Name: Age, dtype: int64

In [25]:
print(df.Age)
df.Age

0    25
1    56
2    52
3    41
Name: Age, dtype: int64

0    25
1    56
2    52
3    41
Name: Age, dtype: int64

# Label Based Indexing (Loc)

In [28]:
import pandas as pd

In [31]:
df = pd.DataFrame({
    'Name':['Alice', 'Ram','Sita', 'David'],
    'Age': [25,56,52,41],
    'City': ['New York', 'KTM', 'Lalitpur', 'Boston']
}, index=['a', 'b','c','d'])
df

    Name  Age      City
a  Alice   25  New York
b    Ram   56       KTM
c   Sita   52  Lalitpur
d  David   41    Boston

In [36]:
df.to_csv('demo.csv', index=False)

In [39]:
print(df.loc['b'])

Name    Ram
Age      56
City    KTM
Name: b, dtype: object

In [40]:
print(df.loc['b', ['Name', 'Age']])

Name    Ram
Age      56
Name: b, dtype: object

In [42]:
print(df.loc[['a','c']])

    Name  Age      City
a  Alice   25  New York
c   Sita   52  Lalitpur

In [43]:
print(df.loc['a':'d'])

    Name  Age      City
a  Alice   25  New York
b    Ram   56       KTM
c   Sita   52  Lalitpur
d  David   41    Boston

In [47]:
print(df.loc[df['Age']>30])

    Name  Age      City
b    Ram   56       KTM
c   Sita   52  Lalitpur
d  David   41    Boston

In [49]:
print(df.loc[df['City'] == "KTM"])

  Name  Age City
b  Ram   56  KTM

# Interger Position Based Indexing (iloc)

In [48]:
df = pd.DataFrame({
    'Name':['Alice', 'Ram','Sita', 'David'],
    'Age': [25,56,52,41],
    'City': ['New York', 'KTM', 'Lalitpur', 'Boston']
}, index=['a', 'b','c','d'])
df

    Name  Age      City
a  Alice   25  New York
b    Ram   56       KTM
c   Sita   52  Lalitpur
d  David   41    Boston

In [50]:
print(df.iloc[1])

Name    Ram
Age      56
City    KTM
Name: b, dtype: object

In [51]:
print(df.iloc[[0,2]])

    Name  Age      City
a  Alice   25  New York
c   Sita   52  Lalitpur

In [53]:
print(df.iloc[1,1])

56

In [63]:
print(df.iloc[2, [0,2]])

Name        Sita
City    Lalitpur
Name: c, dtype: object

In [56]:
print(df.iloc[1:3])

   Name  Age      City
b   Ram   56       KTM
c  Sita   52  Lalitpur

In [64]:
print(df.iloc[:,[0,2]])

    Name      City
a  Alice  New York
b    Ram       KTM
c   Sita  Lalitpur
d  David    Boston

# Data Filtering

In [65]:
adults = df[df.Age >= 30]
adults

    Name  Age      City
b    Ram   56       KTM
c   Sita   52  Lalitpur
d  David   41    Boston

In [66]:
adult_from_kathmandu = df[(df.Age >= 30) & (df.City == "KTM")]
adult_from_kathmandu

  Name  Age City
b  Ram   56  KTM

# Data Append and Sorting

In [67]:
df['Country'] = 'USA'
df

    Name  Age      City Country
a  Alice   25  New York     USA
b    Ram   56       KTM     USA
c   Sita   52  Lalitpur     USA
d  David   41    Boston     USA

In [68]:
df['Age_in_months'] = df['Age'] * 12
df

    Name  Age      City Country  Age_in_months
a  Alice   25  New York     USA            300
b    Ram   56       KTM     USA            672
c   Sita   52  Lalitpur     USA            624
d  David   41    Boston     USA            492

In [69]:
df = df.rename(columns={'Name' : 'Full_name'})
df

  Full_name  Age      City Country  Age_in_months
a     Alice   25  New York     USA            300
b       Ram   56       KTM     USA            672
c      Sita   52  Lalitpur     USA            624
d     David   41    Boston     USA            492

In [74]:
df_sort = df.sort_values(by="Age", ascending=False)
df_sort

  Full_name  Age      City Country  Age_in_months
b       Ram   56       KTM     USA            672
c      Sita   52  Lalitpur     USA            624
d     David   41    Boston     USA            492
a     Alice   25  New York     USA            300

# Grouping And Aggregation

In [76]:
df = pd.DataFrame({
    'Category': ['A', 'B', 'A', 'B', 'A', 'C'],
    'Values': [10,20,15,25,30,40]
})
df

  Category  Values
0        A      10
1        B      20
2        A      15
3        B      25
4        A      30
5        C      40

In [80]:
grouped = df.groupby('Category').sum()
grouped

          Values
Category
A             55
B             45
C             40

In [81]:
result = df.groupby('Category').agg(['sum', 'mean', 'count', 'min', 'max'])
result

         Values
            sum       mean count min max
Category
A            55  18.333333     3  10  30
B            45  22.500000     2  20  25
C            40  40.000000     1  40  40

In [83]:
df = pd.DataFrame({
    'Category': ['A', 'B', 'A', 'B', 'A', 'C'],
    'Value1': [10,20,15,25,30,40],
    'Value2': [100,200,150,250,300,400],
})
result = df.groupby('Category').agg({
    'Value1': ['sum', 'mean'],
    'Value2': ['min', 'max']
})
result

         Value1            Value2
            sum       mean    min  max
Category
A            55  18.333333    100  300
B            45  22.500000    200  250
C            40  40.000000    400  400

# Handling Missing Data

In [85]:
import pandas as pd
import numpy as np

In [86]:
df = pd.DataFrame({
    'A':[1,2,np.nan,4],
    'B':[5, np.nan, np.nan,8],
    'C': ['a', 'b', 'c', None]
})
df

     A    B     C
0  1.0  5.0     a
1  2.0  NaN     b
2  NaN  NaN     c
3  4.0  8.0  None

In [88]:
print(df.isna())

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False
3  False  False   True

In [89]:
print(df.isna().sum())

A    1
B    2
C    1
dtype: int64

In [97]:
print(f"Total missing values:{df.isna().sum().sum()}")

Total missing values:4

In [99]:
print(f"Percentage Missing:{df.isna().mean().mean()*100:.2f}")

Percentage Missing:33.33

In [100]:
df_filled = df.fillna(0)
df_filled

     A    B  C
0  1.0  5.0  a
1  2.0  0.0  b
2  0.0  0.0  c
3  4.0  8.0  0

# CSV to DataFrame

In [101]:
df= pd.read_csv('data.csv')

In [102]:
df

    Duration          Date  Pulse  Maxpulse  Calories
0         60  '2020/12/01'    110       130     409.1
1         60  '2020/12/02'    117       145     479.0
2         60  '2020/12/03'    103       135     340.0
3         45  '2020/12/04'    109       175     282.4
4         45  '2020/12/05'    117       148     406.0
5         60  '2020/12/06'    102       127     300.0
6         60  '2020/12/07'    110       136     374.0
7        450  '2020/12/08'    104       134     253.3
8         30  '2020/12/09'    109       133     195.1
9         60  '2020/12/10'     98       124     269.0
10        60  '2020/12/11'    103       147     329.3
11        60  '2020/12/12'    100       120     250.7
12        60  '2020/12/12'    100       120     250.7
13        60  '2020/12/13'    106       128     345.3
14        60  '2020/12/14'    104       132     379.3
15        60  '2020/12/15'     98       123     275.0
16        60  '2020/12/16'     98       120     215.2
17        60  '2020/12/17'    100       120     300.0
18        45  '2020/12/18'     90       112       NaN
19        60  '2020/12/19'    103       123     323.0
20        45  '2020/12/20'     97       125     243.0
21        60  '2020/12/21'    108       131     364.2
22        45           NaN    100       119     282.0
23        60  '2020/12/23'    130       101     300.0
24        45  '2020/12/24'    105       132     246.0
25        60  '2020/12/25'    102       126     334.5
26        60      20201226    100       120     250.0
27        60  '2020/12/27'     92       118     241.0
28        60  '2020/12/28'    103       132       NaN
29        60  '2020/12/29'    100       132     280.0
30        60  '2020/12/30'    102       129     380.3
31        60  '2020/12/31'     92       115     243.0

In [105]:
df.to_csv('new_csv,csv', index=False)

In [106]:
df.head()

   Duration          Date  Pulse  Maxpulse  Calories
0        60  '2020/12/01'    110       130     409.1
1        60  '2020/12/02'    117       145     479.0
2        60  '2020/12/03'    103       135     340.0
3        45  '2020/12/04'    109       175     282.4
4        45  '2020/12/05'    117       148     406.0

In [107]:
df.tail()

    Duration          Date  Pulse  Maxpulse  Calories
27        60  '2020/12/27'     92       118     241.0
28        60  '2020/12/28'    103       132       NaN
29        60  '2020/12/29'    100       132     280.0
30        60  '2020/12/30'    102       129     380.3
31        60  '2020/12/31'     92       115     243.0